import { StepType } from "@reactour/tour";

interface ITourItem {
  steps: StepType[];
}

export interface ITourData {
  [key: string]: ITourItem;
}

export const tourData: ITourData = {
  login: {
    steps: [
      {
        selector: "#tour-login-mode",
        content:
          "با کاهش درخشندگی صفحه و استفاده از رنگ‌های تیره، خستگی چشمان شما در مشاهده پلتفرم کاهش می‌یابد و می‌توانید بر روی محتوا متمرکز شوید. با کلیک برروی این دکمه می توانید حالت Dark Mode را روشن کنید.",
      },
      {
        selector: "#tour-login-with",
        content:
          "کاربر عزیز شما به 2 صورت می توانید وارد پلتفرم شوید: از طرق کلمه عبور ثابت یا از طریق ارسال کلمه عبور موقت به تلفن همراه خود (کد 6 رقمی ارسالی به تلفن همراه خود را وارد کنید). توجه داشته باشید شما باید در پلتفرم عضو و فعال باشید در صورتی که عضو نیستید امکان ورود وجود ندارد.",
      },
      {
        selector: "#tour-login-no-auth",
        content:
          "به منظور حفظ محرمانگی و حقوق کارمندان محترم بدون احراز هویت می توانید، فرم هایی که سازمان برای تکمیل در نظر گرفته را تکمیل نمایید. اطلاعات هویتی شما محرمانه خواهد بود.",
      },
    ],
  },
  applications: {
    steps: [
      {
        selector: "#tour-application-notif",
        padding: 4,
        content:
          "تمامی اعلانات در این قسمت به شما نمایش داده می شود و با کلیک بر روی هر یک از آنها به قسمت مورد نظر وارد می شوید.",
      },
      {
        selector: "#tour-application-floating-button",
        content:
          "در دکمه شناور امکان خروج از سامانه، بازگشت به خانه و یکسری امکانات عمومی فراهم شده است.",
      },
      {
        selector: "#tour-application-card",
        content:
          "سامانه ها و میانبر های هر سامانه، هر یک در کارت های جداگانه نمایش داده می شوند و با کلیک بر روی هر یک به قسمت مورد نظر وارد می شوید.",
      },
    ],
  },
};
